export interface NaVsNoData {
  choices: string[];
  questions: Record<string, string[]>;
}

export const naVsNoData: NaVsNoData = {
  choices: ['な', 'の'],
  questions: {
    'な': [
      '好[す]き',
      '簡[かん]単[たん]',
      '大[たい]切[せつ]',
      'だめ',
      '静[しず]か',
      '大[たい]変[へん]',
      'すてき',
      '勝[かっ]手[て]',
      '複[ふく]雑[ざつ]',
      '妙[みょう]',
      '正[せい]確[かく]',
      '変[へん]',
      '必[ひつ]要[よう]',
      '深[しん]刻[こく]',
      '困[こん]難[なん]',
      '苦[にが]手[て]',
      '危[き]険[けん]',
      '嫌[きら]い',
      '無[む]理[り]',
      '異[い]常[じょう]',
      '正[しょう]直[じき]',
      '親[しん]切[せつ]',
      '残[ざん]酷[こく]',
      '有[ゆう]能[のう]',
      '冷[れい]静[せい]',
      '真[しん]剣[けん]',
      '慎[しん]重[ちょう]',
      '元[げん]気[き]',
      '健[けん]康[こう]',
      '安[あん]全[ぜん]',
      '美[び]人[じん]',
      '不[ふ]思[し]議[ぎ]',
      '平[へい]和[わ]',
      '幸[しあわ]せ',
      '不[ふ]幸[こう]',
      '不[ふ]安[あん]',
      '高[こう]級[きゅう]',
      '平[びょう]等[どう]'
    ],
    'の': [
      '少[すこ]し',
      '本[ほん]当[とう]',
      '永[えい]遠[えん]',
      '最[さい]大[だい]',
      'たくさん',
      '真[しん]実[じつ]',
      '一[いっ]杯[ぱい]',
      '大[たい]量[りょう]',
      '病[びょう]気[き]',
      '最[さい]高[こう]',
      '普[ふ]通[つう]',
      '未[み]定[てい]',
      '独[どく]自[じ]',
      '最[さい]速[そく]',
      '一[いち]流[りゅう]',
      '個[こ]別[べつ]',
      '固[こ]有[ゆう]',
      '別[べつ]',
      '無[む]名[めい]',
      '未[み]知[ち]'
    ]
  }
};
